GenevGitHub/Genev_CC2652R7_Firmware/Application/brake_and_throttle.c
    if((brakeADCsample < BRAKE_ADC_CALIBRATE_L))
    {
        brakeADCsample = BRAKE_ADC_CALIBRATE_L;
    }

    brakeADCSamples[ brakeAndThrottleIndex ] = brakeADCsample;

    /*******************************************************************************************************************************
     *      the sampling interval is defined by "GPT_TIME"
     *      the number of samples is defined by "BRAKE_AND_THROTTLE_SAMPLES"
     *      Sum the most recent "BRAKE_AND_THROTTLE_SAMPLES" number of data points, and
     *      calculate weighted moving average brake and throttle ADC values
     *      Weight factor of 2 is applied to the newest throttle sample, all other samples have weight factor of 1
     *******************************************************************************************************************************/
    uint16_t    brakeADCsum = 0;
    uint16_t    throttleADCsum = 0;
    uint8_t     jj;

    for (jj = 0; jj < BRAKE_AND_THROTTLE_SAMPLES; jj++)
    {
        brakeADCsum += brakeADCSamples[jj];
        throttleADCsum += throttleADCSamples[jj];
    }

    /***** Calculate moving average values ******/
    uint16_t    brakeADCAvg = brakeADCsum / BRAKE_AND_THROTTLE_SAMPLES;             // declared as global variable for debugging only
    uint16_t    throttleADCAvg = throttleADCsum / BRAKE_AND_THROTTLE_SAMPLES;

    /********************************************************************************************************************************
     *  brakePercent is in percentage - has value between 0 - 100 %
     ********************************************************************************************************************************/
    brakePercent = (brakeADCAvg - BRAKE_ADC_CALIBRATE_L) * 100 / (BRAKE_ADC_CALIBRATE_H - BRAKE_ADC_CALIBRATE_L);
    /********************************************************************************************************************************
     *  throttlePercent is in percentage - has value between 0 - 100 %
     ********************************************************************************************************************************/
    throttlePercent = (throttleADCAvg - THROTTLE_ADC_CALIBRATE_L) * 100 / (THROTTLE_ADC_CALIBRATE_H - THROTTLE_ADC_CALIBRATE_L);

    /*****  update brakeAndThrottle_errorMsg on STM32MCPDArray.error_msg  *****/
    ptr_bat_STM32MCPDArray->error_msg = brakeAndThrottle_errorMsg;

    /********************** Brake Power Off Protect State Machine  *******************************************************************************
     *              if brake is engaged, defined as brakePercent being greater than say 50%,
     *              dashboard will instruct motor controller to cut power to motor for safety precautions.
     *              Once power to motor is cut, both the brake & throttle must be fully released before power delivery can be resumed
    **********************************************************************************************************************************************/
    if (brake_errorStatus == 0)
    {/* if there is no brake error .... */
     /* condition where brake is engaged (1) and throttle is greater than 30% */
        if ((brakeStatus == 1) && (brakePercent <= BRAKEPERCENTTHRESHOLD) && (throttlePercent <= THROTTLEPERCENTTHRESHOLD))
        { // This condition resets brakeStatus to zero
            brakeStatus = 0;
        }
        else if ((brakeStatus == 0) && (brakePercent > BRAKEPERCENTTHRESHOLD))
        {// condition when brake is not initially pressed and rider pulls on the brake
            brakeStatus = 1;    // if brakeStatus == 1, cut power to motor
        }
    }
    else
    {  // when brake_errorStatus == 1
        brakeStatus = 0;    // if we set brakeStatus = 1 when brake error exists, the motor will be disabled completely.
                            // if we set brakeStatus = 0 when brake error exists, we could still operate the motor with throttle
    }

    /**************************************************************************************
     *       if Brake is engaged -> cut power to motor and activate brake light
     **************************************************************************************/
    ptr_bat_STM32MCPDArray->brake_percent = brakePercent;
    ptr_bat_STM32MCPDArray->brake_status = brakeStatus;

    /******** Get RPM from mcu  ******************/
    RPM_prev = RPM_temp;                                // this is the previous RPM_temp value.  For studying purposes only

    RPM_temp = ptr_bat_MCUDArray->speed_rpm;            //

    /******** compute drpm / dIQ  -  For studying purposes only   **********/
    if (((IQ_applied - IQapp_prev) == 0) || ((RPM_temp - RPM_prev)/(IQ_applied - IQapp_prev) >= 0xFFFF) ||
            ((RPM_temp - RPM_prev)/(IQ_applied - IQapp_prev) <= -0xFFFF))
    {
        drpmdIQ = 0xFFFF;
    }
    else
    {
        drpmdIQ = (RPM_temp - RPM_prev)/(IQ_applied - IQapp_prev);
    }

    IQapp_prev = IQ_applied;                            // for studying purposes only

    /******** End compute drpm / dIQ  -  For investigation only   **********/

    /******** Throttle Error Safety Protocol -> when throttle error detected or speed is negative, IQ_input is set to zero
     *  Calculating the IQ Value
     *  Notes: Power is delivered to the motor if:
     *   (1) brake is not engaged
     *   (2) RPM is above the REG_MINP_RPM
     *  These features are for safety reasons
     **********************************************************************************/
    if ((!throttle_errorStatus) || (ptr_bat_MCUDArray->rpm_status))
    {
        if ((brakeStatus)||(RPM_temp < REG_MINP_RPM))
        {
        /*The E-Scooter Stops*/
        /*DRIVE_START = 0 --> Then we don't need to send dynamic Iq messages to the motor controller in order to relieve the UART loads*/
#ifdef ESCOOTER_RUN
            IQ_input = 0;
#endif

#ifdef ESCOOTER_DEBUG
            /*The E-Scooter Starts*/
            /*DRIVE_START = 1 --> The We could send dynamic Iq messages to the motor controller */
            IQ_input = speedModeIQmax * throttlePercent / 100;
#endif
        }
        else
        {
        /*The E-Scooter Starts*/
        /*DRIVE_START = 1 --> The We could send dynamic Iq messages to the motor controller */
            IQ_input = speedModeIQmax * throttlePercent / 100;
        }

    /***** Normal Law: modulated IQ_applied depending on rpm limit and output power limit *********************/
        if (ControlLaw == BRAKE_AND_THROTTLE_NORMALLAW)
        {
            brake_and_throttle_normalLawControl();
        }
        else
        {
            IQ_applied = IQ_input;
        }
    /***** End Normal Law *************************************/

